#Вывести на экран все чётные значения в диапазоне от 1 до 497
for i in range(0, 498, 2):
    print(i)